{
  "acq": "News about acquisitions, mergers, and company takeovers.",
  "alum": "Reports related to the aluminum industry and aluminum prices.",
  "barley": "Articles concerning barley production, trade, or pricing.",
  "bop": "Balance of Payments data, reflecting a country’s trade and financial flows.",
  "carcass": "News about meat products, especially carcass prices and trade.",
  "castor-oil": "Reports on the castor oil market, including production and trade.",
  "cocoa": "News concerning the cocoa industry, including production, trade, and pricing.",
  "coconut": "Articles focused on coconut farming, trade, and related markets.",
  "coconut-oil": "Reports on the coconut oil industry and market trends.",
  "coffee": "Coverage of coffee production, market prices, and global trade.",
  "copper": "News on copper prices, production levels, and industrial demand.",
  "corn": "Reports on corn production, trade, pricing, and global markets.",
  "cotton": "Articles about cotton farming, pricing, trade, and market dynamics.",
  "crude": "News regarding crude oil prices, supply, demand, and geopolitical influences.",
  "cpi": "Consumer Price Index — a measure of inflation reflecting changes in consumer prices.",
  "cpu": "Central Processing Unit market news, potentially related to tech stocks or manufacturing.",
  "dfl": "Deutsche Financial Unit or the Deutsche Mark (DM) in financial contexts.",
  "dlr": "Coverage of the U.S. dollar in global currency markets.",
  "dmk": "News concerning the Deutsche Mark (German currency prior to the Euro).",
  "earn": "Reports on corporate earnings, quarterly financial results, and profitability.",
  "fuel": "Articles related to fuel prices, supply chains, and energy consumption.",
  "gas": "News about natural gas production, distribution, and market fluctuations.",
  "gnp": "Gross National Product — a measure of a country's economic output including foreign investments.",
  "gold": "Reports on the gold market, including pricing, mining, and trade.",
  "grain": "Broad coverage of grain markets including wheat, corn, and barley.",
  "groundnut": "Another name for peanuts, often used in agricultural trade reports.",
  "groundnut-oil": "Oil derived from peanuts, commonly used in cooking and trade.",
  "heat": "Articles about heating oil or fuel-related commodities used for heating.",
  "hog": "News about hog farming, livestock markets, and meat pricing.",
  "housing": "Reports on the housing market, real estate trends, and construction data.",
  "income": "Articles related to personal or household income statistics and tax policy.",
  "instal-debt": "Installment debt — long-term consumer credit paid over time, like loans.",
  "interest": "News regarding interest rates, central bank decisions, and financial markets.",
  "ipi": "Index of Industrial Production — a measure of industrial output and productivity.",
  "iron-steel": "Reports on the iron and steel industries, including production and pricing.",
  "jet": "Jet fuel news, including pricing and airline industry demand.",
  "jobs": "Employment-related data, including job growth, unemployment rates, and labor trends.",
  "lead": "News regarding lead mining, production, and market trends.",
  "lei": "Leading Economic Indicators — metrics forecasting future economic activity.",
  "lin-oil": "Linseed oil — used in manufacturing, paints, and industrial processes.",
  "livestock": "Coverage of animal farming, including market dynamics and trade of livestock.",
  "lumber": "Reports on the timber and lumber industry, including pricing and supply issues.",
  "meal-feed": "Articles on animal feed production, trade, and associated commodity markets.",
  "money-fx": "General currency market updates and foreign exchange rate trends.",
  "money-supply": "News on M1, M2 money supply figures and central bank liquidity actions.",
  "nat-gas": "Reports on natural gas supply, demand, storage, and pricing.",
  "nickel": "Market news and analysis related to nickel mining and trade.",
  "nkr": "Norwegian Krone — news related to Norway’s currency in forex markets.",
  "nzdlr": "Coverage of the New Zealand dollar in currency markets.",
  "oat": "Oats commodity news, including agricultural reports and price changes.",
  "oilseed": "Reports on oilseed markets like soybean, sunflower, and rapeseed.",
  "orange": "News on the citrus market, particularly oranges, including supply and trade.",
  "palladium": "Precious metal used in electronics and catalytic converters.",
  "palm-oil": "Vegetable oil widely used in food and cosmetics, majorly produced in Asia.",
  "palmkernel": "Seed of the oil palm, used to produce palm kernel oil.",
  "pet-chem": "Coverage of the petrochemical industry, its products, and global trade.",
  "platinum": "Reports related to platinum mining, usage in industry, and market pricing.",
  "potato": "News related to the potato market, including harvest and pricing.",
  "propane": "Articles focused on the propane gas market, pricing, and usage trends.",
  "rape-oil": "Coverage of rapeseed oil production and international markets.",
  "rapeseed": "Reports about the cultivation and trade of rapeseed crops.",
  "reserves": "Central bank reserves and foreign exchange holdings.",
  "retail": "Retail sales and consumer spending news, often tied to economic health.",
  "rice": "News about rice production, global trade, and food security.",
  "rubber": "Articles covering natural and synthetic rubber markets.",
  "rye": "Grain crop used for food and alcohol production, often traded globally.",
  "ship": "News concerning maritime trade, shipping logistics, and cargo data.",
  "silver": "Reports on silver market trends, pricing, and mining.",
  "sorghum": "Drought-resistant grain crop used in animal feed and food products.",
  "soy-meal": "Protein-rich meal left after soybean oil extraction, used in animal feed.",
  "soy-oil": "News on soybean oil markets, including production and exports.",
  "soybean": "Reports related to soybean farming, exports, and commodity pricing.",
  "strategic-metal": "Articles on rare and strategic metals vital for defense or tech industries.",
  "sugar": "Coverage of sugar markets, pricing, and global trade.",
  "sun-meal": "Meal byproduct from sunflower seeds, used in animal feed.",
  "sun-oil": "Reports about sunflower oil production and market activity.",
  "sunseed": "News on sunflower seed farming and export markets.",
  "tea": "Articles related to the global tea trade, production, and consumption.",
  "tin": "Reports on tin mining, pricing, and usage in manufacturing.",
  "trade": "General news on international trade relations, policies, and agreements.",
  "veg-oil": "General term covering vegetable oil markets such as palm, soy, and sunflower oils.",
  "wheat": "Reports on wheat production, trade, and global market pricing.",
  "wpi": "Wholesale Price Index — tracks price movements at the wholesale level.",
  "yen": "Coverage of the Japanese Yen in the context of global currency markets.",
  "zinc": "News related to zinc production, usage in alloys, and market pricing.",
  "copra-cake": "Byproduct of coconut oil extraction, used as animal feed.",
  "cotton-oil": "Oil extracted from cotton seeds, used in cooking and food processing.",
  "l-cattle": "Live cattle — related to futures markets and the beef industry.",
  "naphtha": "A flammable liquid hydrocarbon used as a fuel and in petrochemical production.",
  "rand": "The currency of South Africa, used in foreign exchange and economic reports."
}